xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/01.controller_unit.old/system/libs/fwlib/py32l090_hal_dma.c
  /* Process unlocked */
  __HAL_UNLOCK(hdma);

  return HAL_OK;
}

/**
  * @brief  Handles DMA interrupt request.
  * @param  hdma: pointer to a DMA_HandleTypeDef structure that contains
  *               the configuration information for the specified DMA Channel.
  * @retval None
  */
void HAL_DMA_IRQHandler(DMA_HandleTypeDef *hdma)
{
  uint32_t flag_it = hdma->DmaBaseAddress->ISR;
  uint32_t source_it = hdma->Instance->CCR;

  /* Half Block Transfer Complete Interrupt management ******************************/
  if (((flag_it & (DMA_FLAG_HBT1 << hdma->ChannelIndex)) != RESET) && ((source_it & DMA_IT_HBT) != RESET))
  {
    /* Disable the half Block transfer interrupt if the DMA mode is NORMAL */
    if(hdma->Init.Mode == DMA_NORMAL)
    {
      /* Disable the half Block transfer interrupt */
      __HAL_DMA_DISABLE_IT(hdma, DMA_IT_HBT);
    }
    /* Clear the half Block transfer complete flag */
    __HAL_DMA_CLEAR_FLAG(hdma, __HAL_DMA_GET_HBT_FLAG_INDEX(hdma));

    /* DMA peripheral state is not updated in Half Block Transfer */
    /* but in Transfer Complete case */

    if(hdma->XferHalfBlockCpltCallback != NULL)
    {
      /* Half transfer callback */
      hdma->XferHalfBlockCpltCallback(hdma);
    }
  }
  
  /* Block Transfer Complete Interrupt management ******************************/
  else if (((flag_it & (DMA_FLAG_BTC1 << hdma->ChannelIndex)) != RESET) && ((source_it & DMA_IT_BTC) != RESET))
  {
    /* Disable the Block transfer interrupt if the DMA mode is NORMAL */
    if(hdma->Init.Mode == DMA_NORMAL)
    {
      /* Disable the Block transfer interrupt */
      __HAL_DMA_DISABLE_IT(hdma, DMA_IT_BTC);
    }
    
    if(hdma->XferBlockCpltCallback != NULL)
    {
      /* transfer callback */
      hdma->XferBlockCpltCallback(hdma);
    }
    
    /* Clear the Block transfer complete flag */
    __HAL_DMA_CLEAR_FLAG(hdma, __HAL_DMA_GET_BTC_FLAG_INDEX(hdma));
  }

  /* Transfer Complete Interrupt management ***********************************/
  else if (((flag_it & (DMA_FLAG_TC1 << hdma->ChannelIndex)) != RESET) && ((source_it & DMA_IT_TC) != RESET))
  {
    if(hdma->Init.Mode == DMA_NORMAL)
    {
      /* Disable the transfer complete and error interrupt */
      __HAL_DMA_DISABLE_IT(hdma, DMA_IT_TE | DMA_IT_TC);

      /* Change the DMA state */
      hdma->State = HAL_DMA_STATE_READY;
    }
    else if(hdma->Init.Mode == DMA_FINITE_CIRCULAR)
    {
      /* Disable all interrupts */
      __HAL_DMA_DISABLE_IT(hdma, DMA_IT_TE | DMA_IT_TC | DMA_IT_BTC | DMA_IT_HBT);

      /* Change the DMA state */
      hdma->State = HAL_DMA_STATE_READY;
    }
    
    /* Clear the transfer complete flag */
    __HAL_DMA_CLEAR_FLAG(hdma, __HAL_DMA_GET_TC_FLAG_INDEX(hdma));

    /* Process Unlocked */
    __HAL_UNLOCK(hdma);

    if(hdma->XferCpltCallback != NULL)
    {
      /* Transfer complete callback */
      hdma->XferCpltCallback(hdma);
    }
  }

  /* Transfer Error Interrupt management **************************************/
  else if (( RESET != (flag_it & (DMA_FLAG_TE1 << hdma->ChannelIndex))) && (RESET != (source_it & DMA_IT_TE)))
  {
    /* When a DMA transfer error occurs */
    /* A hardware clear of its EN bits is performed */
    /* Disable ALL DMA IT */
    __HAL_DMA_DISABLE_IT(hdma, (DMA_IT_TC | DMA_IT_BTC | DMA_IT_HBT | DMA_IT_TE));

    /* Clear all flags */
    hdma->DmaBaseAddress->IFCR = (DMA_ISR_TCIF1 << (hdma->ChannelIndex));
    hdma->DmaBaseAddress->IFCR = (DMA_ISR_BTCIF1 << (hdma->ChannelIndex));
    hdma->DmaBaseAddress->IFCR = (DMA_ISR_HBTIF1 << (hdma->ChannelIndex));
    hdma->DmaBaseAddress->IFCR = (DMA_ISR_TEIF1 << (hdma->ChannelIndex));

    /* Update error code */
    hdma->ErrorCode = HAL_DMA_ERROR_TE;

    /* Change the DMA state */
    hdma->State = HAL_DMA_STATE_READY;

    /* Process Unlocked */
    __HAL_UNLOCK(hdma);

    if (hdma->XferErrorCallback != NULL)
    {
      /* Transfer error callback */
      hdma->XferErrorCallback(hdma);
    }
  }
  return;
}

/**
  * @brief Register callbacks
  * @param hdma: pointer to a DMA_HandleTypeDef structure that contains
  *              the configuration information for the specified DMA Channel.
  * @param CallbackID: User Callback identifer
  *                    a HAL_DMA_CallbackIDTypeDef ENUM as parameter.
  * @param pCallback: pointer to private callbacsk function which has pointer to
  *                   a DMA_HandleTypeDef structure as parameter.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DMA_RegisterCallback(DMA_HandleTypeDef *hdma, HAL_DMA_CallbackIDTypeDef CallbackID, void (* pCallback)( DMA_HandleTypeDef * _hdma))
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Process locked */
  __HAL_LOCK(hdma);

  if(HAL_DMA_STATE_READY == hdma->State)
  {
    switch (CallbackID)
    {
    case  HAL_DMA_XFER_CPLT_CB_ID:
      hdma->XferCpltCallback = pCallback;
      break;

    case  HAL_DMA_XFER_BLOCK_CPLT_CB_ID:
      hdma->XferBlockCpltCallback = pCallback;
      break;
    
    case  HAL_DMA_XFER_HALFBLOCK_CPLT_CB_ID:
      hdma->XferHalfBlockCpltCallback = pCallback;
      break;

    case  HAL_DMA_XFER_ERROR_CB_ID:
      hdma->XferErrorCallback = pCallback;
      break;

    case  HAL_DMA_XFER_ABORT_CB_ID:
      hdma->XferAbortCallback = pCallback;
      break;

    default:
      status = HAL_ERROR;
      break;
    }
  }
  else
  {
    status = HAL_ERROR;
  }

  /* Release Lock */
  __HAL_UNLOCK(hdma);

  return status;
}

/**
  * @brief UnRegister callbacks
  * @param hdma: pointer to a DMA_HandleTypeDef structure that contains
  *              the configuration information for the specified DMA Channel.
  * @param CallbackID: User Callback identifer
  *                    a HAL_DMA_CallbackIDTypeDef ENUM as parameter.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DMA_UnRegisterCallback(DMA_HandleTypeDef *hdma, HAL_DMA_CallbackIDTypeDef CallbackID)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Process locked */
  __HAL_LOCK(hdma);

  if(HAL_DMA_STATE_READY == hdma->State)
  {
    switch (CallbackID)
    {
    case  HAL_DMA_XFER_CPLT_CB_ID:
      hdma->XferCpltCallback = NULL;
      break;

    case  HAL_DMA_XFER_BLOCK_CPLT_CB_ID:
      hdma->XferBlockCpltCallback = NULL;
      break;
    
    case  HAL_DMA_XFER_HALFBLOCK_CPLT_CB_ID:
      hdma->XferHalfBlockCpltCallback = NULL;
      break;

    case  HAL_DMA_XFER_ERROR_CB_ID:
      hdma->XferErrorCallback = NULL;
      break;

    case  HAL_DMA_XFER_ABORT_CB_ID:
      hdma->XferAbortCallback = NULL;
      break;

    case   HAL_DMA_XFER_ALL_CB_ID:
      hdma->XferCpltCallback = NULL;
      hdma->XferBlockCpltCallback = NULL;
      hdma->XferHalfBlockCpltCallback = NULL;
      hdma->XferErrorCallback = NULL;
      hdma->XferAbortCallback = NULL;
      break;

    default:
      status = HAL_ERROR;
      break;
    }
  }
  else
  {
    status = HAL_ERROR;
  }

  /* Release Lock */
  __HAL_UNLOCK(hdma);

